//* NCP stage 1 for the sample N16A; SYS1.NCPSTG1 (the stage 2 deck) goes to the card punch
//CLEAN    EXEC PGM=IEHPROGM
//SYSPRINT DD SYSOUT=A
//DD3      DD UNIT=3350,VOL=SER=NCPSSP,DISP=OLD
//SYSIN    DD *
  SCRATCH DSNAME=SYS1.NCPOBJ1,VOL=3350=NCPSSP,PURGE
  SCRATCH DSNAME=SYS1.NCPSTG1,VOL=3350=NCPSSP,PURGE
/*
//STAGE1   EXEC PGM=CWAX00,REGION=320K
//STEPLIB  DD DSN=SYS1.SSPLIB,DISP=SHR,UNIT=3350,VOL=SER=NCPSSP
//SYSLIB   DD DSN=SYS1.GEN3705,DISP=SHR,UNIT=3350,VOL=SER=NCPSSP
//OBJ1     DD UNIT=3350,VOL=SER=NCPSSP,DISP=(,CATLG),
//            SPACE=(CYL,(2,1,10)),
//            DCB=(LRECL=80,RECFM=FB,BLKSIZE=400),DSN=SYS1.NCPOBJ1
//SYSUT1   DD UNIT=SYSDA,SPACE=(1700,(800,800)),DCB=(OPTCD=C)
//SYSUT2   DD UNIT=SYSDA,SPACE=(1700,(800,800)),DCB=(OPTCD=C)
//SYSUT3   DD UNIT=SYSDA,SPACE=(1700,(800,800)),DCB=(OPTCD=C)
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DSN=SYS1.NCPSTG1,VOL=SER=NCPSSP,DISP=(,KEEP),
//            UNIT=3350,SPACE=(CYL,(2,1)),
//            DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)
//SYSIN    DD DSN=SYS1.VTAMLST(N16A),DISP=SHR
//PUNCH    EXEC PGM=IEBGENER,COND=(4,LT,STAGE1)
//SYSPRINT DD SYSOUT=A
//SYSIN    DD DUMMY
//SYSUT1   DD DSN=SYS1.NCPSTG1,VOL=SER=NCPSSP,UNIT=3350,DISP=SHR
//SYSUT2   DD SYSOUT=B
//
